Data Analysis workbook

## Data Wrangling OpenStreetMap

In [14]:
# Import chunk library + Dataset

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import unicodecsv
import seaborn as sns

ways_nodes = pd.read_csv("~/PycharmProjects/DAND_OpenStreeMap/subset/ways_nodes.csv")
ways       = pd.read_csv("~/PycharmProjects/DAND_OpenStreeMap/subset/ways.csv")
ways_tags  = pd.read_csv("~/PycharmProjects/DAND_OpenStreeMap/subset/ways_tags.csv")
nodes      = pd.read_csv("~/PycharmProjects/DAND_OpenStreeMap/subset/nodes.csv")
nodes_tags = pd.read_csv("~/PycharmProjects/DAND_OpenStreeMap/subset/nodes_tags.csv")

### Way Nodes :

In [8]:
print ways_nodes.columns
print len(ways_nodes)

Index([u'id', u'node_id', u'position'], dtype='object')
12242

In [9]:
ways_nodes.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>id</th>
      <th>node_id</th>
      <th>position</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>4803849</td>
      <td>34691601</td>
      <td>0</td>
    </tr>
    <tr>
      <th>1</th>
      <td>4803849</td>
      <td>1801000290</td>
      <td>1</td>
    </tr>
    <tr>
      <th>2</th>
      <td>4803849</td>
      <td>1164867374</td>
      <td>2</td>
    </tr>
    <tr>
      <th>3</th>
      <td>4803849</td>
      <td>3397409847</td>
      <td>3</td>
    </tr>
    <tr>
      <th>4</th>
      <td>4803849</td>
      <td>1937688909</td>
      <td>4</td>
    </tr>
  </tbody>
</table>
</div>

### Nodes :

In [16]:
print ways.columns
print len(ways)

Index([u'id', u'user', u'uid', u'version', u'changeset', u'timestamp'], dtype='object')
1410

In [17]:
ways.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>id</th>
      <th>user</th>
      <th>uid</th>
      <th>version</th>
      <th>changeset</th>
      <th>timestamp</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>4803849</td>
      <td>Martin Borsje</td>
      <td>99810</td>
      <td>35</td>
      <td>37882240</td>
      <td>2016-03-16T20:27:25Z</td>
    </tr>
    <tr>
      <th>1</th>
      <td>4803852</td>
      <td>yxcv</td>
      <td>26203</td>
      <td>17</td>
      <td>49958610</td>
      <td>2017-07-01T06:20:06Z</td>
    </tr>
    <tr>
      <th>2</th>
      <td>11963069</td>
      <td>yu nus</td>
      <td>6423151</td>
      <td>16</td>
      <td>50938057</td>
      <td>2017-08-08T09:03:50Z</td>
    </tr>
    <tr>
      <th>3</th>
      <td>11963253</td>
      <td>yu nus</td>
      <td>6423151</td>
      <td>20</td>
      <td>50938057</td>
      <td>2017-08-08T09:03:51Z</td>
    </tr>
    <tr>
      <th>4</th>
      <td>11963816</td>
      <td>Sebra1177</td>
      <td>2557264</td>
      <td>12</td>
      <td>28099349</td>
      <td>2015-01-12T22:15:44Z</td>
    </tr>
  </tbody>
</table>
</div>

### Way Nodes :

In [ ]:
print ways_tags.columns
print len(ways_tags)

In [18]:
ways_tags.head()

<div>
<style>
    .dataframe thead tr:only-child th {
        text-align: right;
    }

    .dataframe thead th {
        text-align: left;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>id</th>
      <th>key</th>
      <th>value</th>
      <th>type</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>4803849</td>
      <td>highway</td>
      <td>primary</td>
      <td>regular</td>
    </tr>
    <tr>
      <th>1</th>
      <td>4803849</td>
      <td>lanes</td>
      <td>2</td>
      <td>regular</td>
    </tr>
    <tr>
      <th>2</th>
      <td>4803849</td>
      <td>maxspeed</td>
      <td>50</td>
      <td>regular</td>
    </tr>
    <tr>
      <th>3</th>
      <td>4803849</td>
      <td>name</td>
      <td>Nauenstrasse</td>
      <td>regular</td>
    </tr>
    <tr>
      <th>4</th>
      <td>4803849</td>
      <td>oneway</td>
      <td>yes</td>
      <td>regular</td>
    </tr>
  </tbody>
</table>
</div>

In [ ]:
### Way Nodes :